app/controllers/books_controller.rb

  def index
      if !params.key?(:genres)
        params[:genres] = {}
      end
      permitted = params.permit(:sort, genres: params[:genres].keys)
      sort = permitted[:sort] || session[:sort]

      case sort
        when 'title'
          ordering, @title_header = {:title => :asc}, 'hilite'
        when 'publish_date'
          ordering, @date_header = {:publish_date => :asc}, 'hilite'
      end

      @all_genres = Book.all_genres
      @selected_genres = permitted[:genres] || session[:genres] || {}
      if @selected_genres == {}
        @selected_genres = Hash[@all_genres.map {|genre| [genre, genre]}]
---
SELECT "books".* FROM "books" WHERE "books"."genre" IN (?, ?, ?, ?, ?, ?)  [["genre", "Science fiction"], ["genre", "Drama"], ["genre", "Action and Adventure"], ["genre", "Romance"], ["genre", "Mystery"], ["genre", "Horror"]]

  def show
      id = params[:id] # retrieve book ID from URI route
      @book = Book.find(id) # look up book by unique ID
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
      params.require(:book)
      permitted = params[:book].permit(:title,:genre,:description,:isbn_number,:publish_date,:author)
      permitted[:title] = permitted[:title].split.map(&:capitalize).join(' ')
      @book = Book.new(permitted)
      if @book.save
---
INSERT INTO "books" ("title", "genre", "description", "isbn_number", "publish_date", "created_at", "updated_at", "author") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
      @book = Book.find(params[:id])
      params.require(:book)
      permitted = params[:book].permit(:title,:id,:genre,:description,:isbn_number,:publish_date,:author)
      if @book.update(permitted)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 60], ["LIMIT", 1]]
UPDATE "books" SET "genre" = ?, "isbn_number" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["genre", "Science fiction"], ["isbn_number", "1-33213-101-8"], ["updated_at", "2021-01-25 17:29:28.942771"], ["id", 60]]

  def search_similar_books
    @given_book = Book.find(params[:id])
    if @given_book.author.nil? || @given_book.author.empty?
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 62], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."author" = ?  [["author", "gfgd"]]